app/controllers/articles_controller.rb

  def create
    @article = Article.create!(title: params[:article][:title], description: params[:article][:description])
---
INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My article title"], ["description", "My article description"], ["created_at", "2019-11-23 21:37:58.705281"], ["updated_at", "2019-11-23 21:37:58.705281"]]

  def update
    @article = Article.find(params[:id])
    @article.update!(title: params[:article][:title], description: params[:article][:description])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2019-11-23 21:44:28.552048"], ["id", 1]]